Конфигурация/InformationRegisters/ЗамещающиеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗамещающиеСотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаВидовОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВидовОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗамещающиеСотрудники/Ext/ManagerModule.bsl
// Замещать может только человек из ответственных:
// нельзя исключать сотрудника из ответственных в дни, когда он замещал,
// и нельзя указывать его замещающим в дни, когда он не был ответственным.
//
// Параметры:
//	СведенияОЗамещениях	- РегистрСведенийНаборЗаписей.ЗамещающиеСотрудники	- проверяемые записи
//						- Структура											- отбор с ключами, соответствующими измерениям регистра ЗамещающиеСотрудники
//						- Неопределено										- проверяются все записи регистра ЗамещающиеСотрудники
//	Отказ				- Булево											- выходной параметр, при ошибке устанавливается в значение Истина 
//
// Возвращаемое значение:
//	ПроверкаУспешна - Булево - Истина, если замещающие входят в списки ответственных за операции 
//
Функция ПроверитьЗамещающихНаВхождениеВСпискиОтветственныхЗаОперации(СведенияОЗамещениях = Неопределено, Отказ = Ложь) Экспорт
	
	#Область Текст_запроса_замещающих_не_являющихся_ответственными	
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗамещающиеСотрудники.Организация КАК Организация,
		|	ЗамещающиеСотрудники.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	ЗамещающиеСотрудники.Сотрудник КАК Сотрудник,
		|	ЗамещающиеСотрудники.Замещающий КАК Замещающий,
		|	ЗамещающиеСотрудники.Период КАК ДатаНачалаЗамещения,
		|	ЗамещающиеСотрудники.ДатаОкончания КАК ДатаОкончанияЗамещения,
		|	ОтветственныеЗаОперации.Период КАК ДатаНачала,
		|	ОтветственныеЗаОперации.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _ЗамещающиеОтветственныеЗаОперации
		|ИЗ
		|	#ЗамещающиеСотрудники# КАК ЗамещающиеСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|		ПО ЗамещающиеСотрудники.ГруппаВидовОпераций = ГруппыВидовОпераций.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ПО (ОтветственныеЗаОперации.Организация = ЗамещающиеСотрудники.Организация)
		|			И (ОтветственныеЗаОперации.ГруппаВидовОпераций = ЗамещающиеСотрудники.ГруппаВидовОпераций)
		|			И (ОтветственныеЗаОперации.Сотрудник = ЗамещающиеСотрудники.Замещающий)
		|			И (ОтветственныеЗаОперации.Период <= ЗамещающиеСотрудники.ДатаОкончания
		|				ИЛИ ЗамещающиеСотрудники.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ЗамещающиеСотрудники.Период <= ОтветственныеЗаОперации.ДатаОкончания
		|				ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	&Организация В (ЗамещающиеСотрудники.Организация, НЕОПРЕДЕЛЕНО)
		|	И &ГруппаВидовОпераций В (ЗамещающиеСотрудники.ГруппаВидовОпераций, НЕОПРЕДЕЛЕНО)
		|	И &Замещающий В (ЗамещающиеСотрудники.Замещающий, НЕОПРЕДЕЛЕНО)
		|	И ГруппыВидовОпераций.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗамещающиеОтветственныеЗаОперации.Организация КАК Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник КАК Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий КАК Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения КАК ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения КАК ДатаОкончанияЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаНачала) ЕСТЬ NULL
		|			ТОГДА _ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаНачала), ДЕНЬ, -1)
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	_ЗамещающиеОтветственныеЗаОперации КАК _ЗамещающиеОтветственныеЗаОперации
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗамещающиеОтветственныеЗаОперации.Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения
		|
		|ИМЕЮЩИЕ
		|	(МИНИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаНачала) > _ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения
		|		ИЛИ МИНИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаНачала) ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗамещающиеОтветственныеЗаОперации.Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения,
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаОкончания), ДЕНЬ, 1),
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения
		|ИЗ
		|	_ЗамещающиеОтветственныеЗаОперации КАК _ЗамещающиеОтветственныеЗаОперации
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗамещающиеОтветственныеЗаОперации.Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаОкончания) <> ДАТАВРЕМЯ(1, 1, 1) И
		|	(МАКСИМУМ(_ЗамещающиеОтветственныеЗаОперации.ДатаОкончания) < _ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения
		|		ИЛИ _ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗамещающиеОтветственныеЗаОперации.Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения,
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(Слева.ДатаОкончания), ДЕНЬ, 1),
		|	ДОБАВИТЬКДАТЕ(_ЗамещающиеОтветственныеЗаОперации.ДатаНачала, ДЕНЬ, -1)
		|ИЗ
		|	_ЗамещающиеОтветственныеЗаОперации КАК _ЗамещающиеОтветственныеЗаОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗамещающиеОтветственныеЗаОперации КАК Слева
		|		ПО _ЗамещающиеОтветственныеЗаОперации.Организация = Слева.Организация
		|			И _ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций = Слева.ГруппаВидовОпераций
		|			И _ЗамещающиеОтветственныеЗаОперации.Сотрудник = Слева.Сотрудник
		|			И _ЗамещающиеОтветственныеЗаОперации.Замещающий = Слева.Замещающий
		|			И _ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения = Слева.ДатаНачалаЗамещения
		|			И _ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения = Слева.ДатаОкончанияЗамещения
		|			И (Слева.ДатаОкончания < _ЗамещающиеОтветственныеЗаОперации.ДатаНачала)
		|			И (Слева.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗамещающиеОтветственныеЗаОперации.Организация,
		|	_ЗамещающиеОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	_ЗамещающиеОтветственныеЗаОперации.Сотрудник,
		|	_ЗамещающиеОтветственныеЗаОперации.Замещающий,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачалаЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаОкончанияЗамещения,
		|	_ЗамещающиеОтветственныеЗаОперации.ДатаНачала
		|
		|ИМЕЮЩИЕ
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(Слева.ДатаОкончания), ДЕНЬ, 1) < _ЗамещающиеОтветственныеЗаОперации.ДатаНачала");
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",			Неопределено);
	Запрос.УстановитьПараметр("ГруппаВидовОпераций",	Неопределено);
	Запрос.УстановитьПараметр("Замещающий",				Неопределено);
	
	Если ТипЗнч(СведенияОЗамещениях) = Тип("РегистрСведенийНаборЗаписей.ЗамещающиеСотрудники") Тогда
		
		Если СведенияОЗамещениях.Количество() = 0 Тогда
			Возврат Истина;	// Если записи удаляются, то проверку не выполняем
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ЗамещающиеСотрудники#", "_ЗамещающиеСотрудники");
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(СведенияОЗамещениях.Выгрузить(), "_ЗамещающиеСотрудники", Запрос);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ЗамещающиеСотрудники#", "РегистрСведений.ЗамещающиеСотрудники");
		
		Если ТипЗнч(СведенияОЗамещениях) = Тип("Структура") Тогда
			Для каждого ЭлементОтбора Из СведенияОЗамещениях Цикл
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Формируем сообщения с ошибками
	
	СоответствиеОшибокЗамещения = Новый Соответствие;
	
	ВыборкаПоОшибке = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаПоОшибке.Следующий() Цикл
		
		КлючЗамещения = СтрШаблон("%1, замещающий %2 c %3 по %4, не находится в списке ответственных за '%5' ",
			ВыборкаПоОшибке.Замещающий,
			ВыборкаПоОшибке.Сотрудник,
			Формат(ВыборкаПоОшибке.ДатаНачалаЗамещения, "ДФ=dd.MM.yyyy"),
			Формат(ВыборкаПоОшибке.ДатаОкончанияЗамещения, "ДФ=dd.MM.yyyy"),
			ВыборкаПоОшибке.ГруппаВидовОпераций);
			
		ПериодОшибкиЗамещения = СтрШаблон("с %1 по %2",
			Формат(ВыборкаПоОшибке.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(ВыборкаПоОшибке.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
		ОшибкиЗамещения = СоответствиеОшибокЗамещения.Получить(КлючЗамещения);
		Если ОшибкиЗамещения = Неопределено Тогда
			ОшибкиЗамещения = Новый Массив;
			СоответствиеОшибокЗамещения.Вставить(КлючЗамещения, ОшибкиЗамещения);
		КонецЕсли;
		ОшибкиЗамещения.Добавить(ПериодОшибкиЗамещения);		
		
	КонецЦикла;
	
	Для Каждого ОшибкиЗамещения Из СоответствиеОшибокЗамещения Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиЗамещения.Ключ + СтрСоединить(ОшибкиЗамещения.Значение, ", "), , , , Отказ);			
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

Функция ЗамещающийСотрудник(Сотрудник, ГруппаВидовОпераций, Период) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗамещающиеСотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗамещающиеСотрудникиСрезПоследних.Замещающий КАК Замещающий
		|ИЗ
		|	РегистрСведений.ЗамещающиеСотрудники.СрезПоследних(
		|			&Период,
		|			ГруппаВидовОпераций = &ГруппаВидовОпераций
		|				И Организация В
		|					(ВЫБРАТЬ
		|						Сотрудники.Организация
		|					ИЗ
		|						Справочник.Сотрудники КАК Сотрудники
		|					ГДЕ
		|						Сотрудники.Ссылка = &Сотрудник)) КАК ЗамещающиеСотрудникиСрезПоследних
		|ГДЕ
		|	(ЗамещающиеСотрудникиСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(ЗамещающиеСотрудникиСрезПоследних.ДатаОкончания, ДЕНЬ) >= &Период)");
	
	Запрос.УстановитьПараметр("ГруппаВидовОпераций",	ГруппаВидовОпераций);
	Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
	Запрос.УстановитьПараметр("Период",		Период);
	
	ТаблицаЗамен = Запрос.Выполнить().Выгрузить();
	ТаблицаЗамен.Индексы.Добавить("Сотрудник");
	
	Замещения = Новый Соответствие;
	Замещения.Вставить(Сотрудник, Сотрудник); // чтобы сам себя не замещал		
	
	ЗамещающийПользователь = Неопределено;
	
	СтрокаЗамещения = ТаблицаЗамен.Найти(Сотрудник, "Сотрудник");
	Пока СтрокаЗамещения <> Неопределено Цикл		
		ЗамещающийСотрудник = СтрокаЗамещения.Замещающий;		
		
		Если Замещения.Получить(ЗамещающийСотрудник) <> Неопределено Тогда
			ВызватьИсключение "Обнаружено зацикливание замещений сотрудников """ + Строка(Сотрудник) + """";
		КонецЕсли;
		Замещения.Вставить(ЗамещающийСотрудник, Сотрудник);		
			
		ТаблицаЗамен.Удалить(СтрокаЗамещения);
		
		СтрокаЗамещения = ТаблицаЗамен.Найти(ЗамещающийСотрудник, "Сотрудник");
	КонецЦикла;
	
	Возврат ЗамещающийСотрудник;
	
КонецФункции

Функция ТаблицаЗамещенийПользователей(Организация, ГруппаВидовОпераций, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Дни.Дата КАК Дата,
		|	ЗамещающиеСотрудники.Сотрудник.Пользователь КАК Пользователь,
		|	ЗамещающиеСотрудники.Замещающий.Пользователь КАК Замещающий
		|ИЗ
		|	_Дни КАК _Дни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗамещающиеСотрудники КАК ЗамещающиеСотрудники
		|		ПО (ЗамещающиеСотрудники.Организация = &Организация)
		|			И (ЗамещающиеСотрудники.ГруппаВидовОпераций = &ГруппаВидовОпераций)
		|			И (ЗамещающиеСотрудники.Период <= _Дни.Дата)
		|			И (КОНЕЦПЕРИОДА(ЗамещающиеСотрудники.ДатаОкончания, ДЕНЬ) >= _Дни.Дата
		|				ИЛИ ЗамещающиеСотрудники.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ГруппаВидовОпераций",	ГруппаВидовОпераций);
	Запрос.УстановитьПараметр("ДатаНачала",				ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",			ДатаОкончания);
	
	КэшЗамещений = Новый Соответствие;
	КешЗамещающих = Новый Соответствие;
	
	ТаблицаЗамещений = Запрос.Выполнить().Выгрузить();
	ТаблицаЗамещений.Индексы.Добавить("Пользователь, Дата");	
	
	Для Каждого СтрокаЗамещения Из ТаблицаЗамещений Цикл
		
		СтруктураПоиска	= Новый Структура("Пользователь, Дата", СтрокаЗамещения.Пользователь, СтрокаЗамещения.Дата);
		КлючПоиска		= ЗначениеВСтрокуВнутр(СтруктураПоиска); // РаботаСоСтрокамиКлиентСервер.ПредставлениеСтруктуры(СтруктураПоиска);
		
		КешЗамещающих.Вставить(КлючПоиска, СтрокаЗамещения.Пользователь); // чтобы сам себя не замещал	
		
		СтрокаЗамещения.Замещающий = НайтиЗамещениеРекурсивно(ТаблицаЗамещений, СтрокаЗамещения.Замещающий, СтрокаЗамещения.Дата, КэшЗамещений, КешЗамещающих);
		
		КэшЗамещений.Вставить(КлючПоиска, СтрокаЗамещения.Замещающий);
		
	КонецЦикла;
		
	Возврат ТаблицаЗамещений;	
	
КонецФункции

#Область Служебные_и_вспомогательные_функции

Функция НайтиЗамещениеРекурсивно(ТаблицаЗамещений, Пользователь, Дата, КэшЗамещений, КешЗамещающих = Неопределено)	
		
	СтруктураПоиска	= Новый Структура("Пользователь, Дата", Пользователь, Дата);
	КлючПоиска		= ЗначениеВСтрокуВнутр(СтруктураПоиска); // РаботаСоСтрокамиКлиентСервер.ПредставлениеСтруктуры(СтруктураПоиска);
	
	Замещение = КэшЗамещений.Получить(КлючПоиска);
	
	Если Замещение = Неопределено Тогда
		
		// Проверка на зацикливание
		
		Если КешЗамещающих.Получить(КлючПоиска) <> Неопределено Тогда
			ВызватьИсключение "Обнаружено зацикливание замещений пользователя """ + Строка(Пользователь) + """ за " + Формат(Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		КешЗамещающих.Вставить(КлючПоиска, Пользователь);	

		// Поиск замещающего
		
		СтрокиЗамещения = ТаблицаЗамещений.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиЗамещения.Количество() > 0 Тогда
			Замещение = НайтиЗамещениеРекурсивно(ТаблицаЗамещений, СтрокиЗамещения[0].Замещающий, Дата, КэшЗамещений, КешЗамещающих);
		Иначе
			Замещение = Пользователь;	
		КонецЕсли;		
		
		КэшЗамещений.Вставить(КлючПоиска, Замещение);
		
	КонецЕсли;
		
	Возврат Замещение;
	
КонецФункции

#КонецОбласти
